<?php
    // простой роут, с использованием хелпера
    omf::i()->route('/news[/[index]]', function(){ // указываем параметры функции
        omf::c(array( // альтернативный вызов контроллера
            'controller'=>'news',
            'vars'=>array('param1','param2'),
        ));
    }, 'news-route-1');

    // -----------------------------------------------------------------------

    // сложный роут с использованием хелпера для получения регулярки
    $route_regexp = omf::i()->route_helper(
            '/news[/@id[[/page]-@pageNumber]]',
            array(
                'id' => '\d+|test',
                'pageNumber' => '\d+',
            ),
            '~^{@regexp}$~ix' // так же можно поменять шаблон по-умолчанию, {@regexp} = будет заменено на скомпилированное рег выражение
    );

    omf::i()->route_regexp($route_regexp, function(){ // не указывем параметры функции
        omf::i()->controller(array( // вызов контроллера
            'controller'=>'news',
           /* 'action'=>'index', */     // вызов action-а по-умолчанию
            'vars'=>func_get_args(), // сразу передаем все аргументы
        ));
    }, 'news-route-2');

    // -----------------------------------------------------------------------

    // сложный роут без использования хелпера
    omf::i()->route_regexp('~^/news/((?:2013|2014)-\d{2}-\d{2})$~', function($date){ // указываем параметры функции
        omf::c(array( // альтернативный вызов контроллера
            'controller'=>'news',
            'action'=>'date',
            'vars'=>array(
               date('d.m.Y', strtotime($date)) // обработка параметров
            ),
        ));
    }, 'news-route-3');

    // -----------------------------------------------------------------------

    omf::i()->route_regexp_array(array('~/feedback~','~/contact~'), function(){ // альтернативные роуты
        die('Альтернативные роуты: feedback, contact');
    });

    // -----------------------------------------------------------------------

    omf::i()->route('/', function(){
        omf::i()->controller();             // контролер с установленными знаачениями по-умолчанию
    }, 'index');

    // -----------------------------------------------------------------------

    // ловим все остальные пути, это 404 ошибка
    omf::i()->route('.*', function(){
        omf::i()->controller(array(
            'controller'=>'errors',
            'action'=>'404',
        ));
    });     // можем не задавать имя роута